<a href="https://colab.research.google.com/github/HarshrajSharma/DataAnalytics/blob/main/DataAnalyticsDay6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### **SQLite3**

In [ ]:
import sqlite3
conn=sqlite3.connect('HITK DB')
curr=conn.cursor()
print('Database Connected!')

curr.execute('create table Student(roll int primary key check(typeof(roll)="integer"), name varchar2(20) check(typeof(name)="text"), percentage int check(typeof(percentage)="integer") )')
print('Table Created!')

Database Connected!
Table Created!

In [ ]:
import sqlite3
conn1=sqlite3.connect('HITK DB')
curr1=conn.cursor()
curr1.execute('drop table Student')
print('Table Dropped!')
conn1.close()

Table Dropped!

In [ ]:
curr.execute('select * from sqlite_master')
print(curr.fetchall())

[('table', 'EMP', 'EMP', 2, 'CREATE TABLE EMP(EmpId int primary key,EmpName varchar2(20) NOT NULL, Salary int NOT NULL Check(Salary>5000), Commission float, DeptId int NOT NULL)'), ('index', 'sqlite_autoindex_EMP_1', 'EMP', 3, None)]

In [ ]:
curr.execute('insert into Student values(1,"Paradox",98)')
curr.execute('insert into Student values(2,"Square",95)')

In [ ]:
curr.executescript('insert into Student values(3,"Gravity",94);\
                    insert into Student values(4,"Nazz",92);\
                    insert into Student values(5, "Spectra",90);')

In [ ]:
curr.execute('select * from Student')
print(curr.fetchall())

[(1, 'Paradox', 98), (2, 'Square', 95), (3, 'Gravity', 94), (4, 'Nazz', 92), (5, 'Spectra', 90)]

### **Home Assignment**

In [ ]:
#1) Write a Python program to create a database DataAnalytics.db. Create a table EMP, with attributes as follows:



import sqlite3
conn=sqlite3.connect('DataAnalytics.db')
print('Database Connected!')
curr=conn.cursor()

curr.execute('create table EMP(EmpId int primary key,EmpName varchar2(20) NOT NULL, Salary int NOT NULL Check(Salary>5000), Commission float, DeptId int NOT NULL)')
print('Table Created!')

Database Connected!
Table Created!

In [ ]:
#Inserting data to EMP Table
curr.executescript('insert into EMP values(1,"Name1",6000,50.0,101);\
                    insert into EMP values(2,"Name2",6000,NULL,101);\
                    insert into EMP values(3,"Name3",6000,56.0,101);\
                    insert into EMP values(4,"Name4",6000,80.2,101);\
                    insert into EMP values(5,"Name5",6000,83.0,201);')

In [ ]:
import sqlite3
conn1=sqlite3.connect('DataAnalytics.db')
curr1=conn.cursor()
curr1.execute('drop table EMP')
print('Table Dropped!')
conn1.close()

Table Dropped!

In [ ]:
curr.execute('select * from EMP')
print(curr.fetchall())

[(1, 'Name1', 6000, 50.0, 101), (3, 'Name3', 6000, 56.0, 101), (4, 'Name4', 6000, 80.2, 101), (5, 'Name5', 6000, 83.0, 201)]

In [ ]:
#2) Write a python code to Delete all records from the Emp table where commission is null and dept id is not D1 or D2 or D3.
#curr.execute('delete from EMP where (commission=NULL) and (deptId!=D1 OR deptId!=D2 OR deptId!=D3)')
curr.execute('delete from EMP where Commission is NULL AND DeptId!=201')

In [ ]:
#3) Find the average salary of each department and also count the number of employees in each department. 
#Next, insert it into a table department, having attributes dept id, number-of-employees, and avg salary. 
#Do not insert any record into the table where avg salary &lt; 12000.

curr.execute('create table department(deptId int, numberOfEmployees int, avgSalary float)')
curr.execute('insert into department(deptId)')